In [73]:
a = 3

In [74]:
print(a)

3

In [75]:
b = 3
c = 4

In [76]:
print(b+c)

7

In [77]:
for x in range(10):
    print(x)

0
1
2
3
4
5
6
7
8
9

In [78]:
import pandas as pd

In [79]:
entries = {
    'maths': [50, 60,70,50,40],
    'science': [40,20,50,60,70]
}

In [80]:
df1 = pd.DataFrame(entries)

In [81]:
df1

   maths  science
0     50       40
1     60       20
2     70       50
3     50       60
4     40       70

In [82]:
df1['science']

0    40
1    20
2    50
3    60
4    70
Name: science, dtype: int64

In [83]:
df1[df1['maths'] >= 50]

   maths  science
0     50       40
1     60       20
2     70       50
3     50       60

In [84]:
entries2 = {
    'maths':[50, 20, None],
    'science': [60, 20, 60]
}

In [85]:
df2 = pd.DataFrame(entries2)

In [86]:
df2

   maths  science
0   50.0       60
1   20.0       20
2    NaN       60

In [87]:
df3 = pd.concat([df1, df2])

In [88]:
df3

   maths  science
0   50.0       40
1   60.0       20
2   70.0       50
3   50.0       60
4   40.0       70
0   50.0       60
1   20.0       20
2    NaN       60

In [89]:
df3 = df3.fillna(0)

In [90]:
df3

   maths  science
0   50.0       40
1   60.0       20
2   70.0       50
3   50.0       60
4   40.0       70
0   50.0       60
1   20.0       20
2    0.0       60

In [91]:
def get_total(row):
    return row['maths'] + row['science']

In [92]:
df3['total'] = df3.apply(get_total, axis=1)

In [93]:
df3

   maths  science  total
0   50.0       40   90.0
1   60.0       20   80.0
2   70.0       50  120.0
3   50.0       60  110.0
4   40.0       70  110.0
0   50.0       60  110.0
1   20.0       20   40.0
2    0.0       60   60.0

In [94]:
def get_percentage(row):
    return row['total'] / 200 * 100

In [95]:
df3['percentage'] = df3.apply(get_percentage, axis=1)

In [96]:
df3

   maths  science  total  percentage
0   50.0       40   90.0        45.0
1   60.0       20   80.0        40.0
2   70.0       50  120.0        60.0
3   50.0       60  110.0        55.0
4   40.0       70  110.0        55.0
0   50.0       60  110.0        55.0
1   20.0       20   40.0        20.0
2    0.0       60   60.0        30.0

In [97]:
def get_pass_status(row):
    if row['percentage'] >= 50:
        return 'Passed'
    else:
        return 'Failed'

In [98]:
df3['status'] = df3.apply(get_pass_status, axis=1)

In [99]:
df3

   maths  science  total  percentage  status
0   50.0       40   90.0        45.0  Failed
1   60.0       20   80.0        40.0  Failed
2   70.0       50  120.0        60.0  Passed
3   50.0       60  110.0        55.0  Passed
4   40.0       70  110.0        55.0  Passed
0   50.0       60  110.0        55.0  Passed
1   20.0       20   40.0        20.0  Failed
2    0.0       60   60.0        30.0  Failed

In [101]:
df3.to_csv('passed_result.csv')